EDT/УТ/src/Documents/НачислениеЗатрат/НачислениеЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗатрат</name>
  <registerRecords>AccumulationRegister.НачислениеЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.НачислениеДоходов</registerRecords>
  <tabularSections>
    <name>ПрямыеЗатраты</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияДоставки</name>
      <type>
        <types>CatalogRef.КатегорииДоставки2014</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗатрат</name>
      <type>
        <types>EnumRef.ТипыЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределяемыеЗатраты</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗатрат</name>
      <type>
        <types>EnumRef.ТипыЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоходыКомпании</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <type>
        <types>CatalogRef.СтатьиДоходовКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияДоставки</name>
      <type>
        <types>CatalogRef.КатегорииДоставки2014</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределенныеЗатраты</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияДоставки</name>
      <type>
        <types>CatalogRef.КатегорииДоставки2014</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗатрат</name>
      <type>
        <types>EnumRef.ТипыЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/НачислениеЗатрат/НачислениеЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачислениеЗатрат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Юрлицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатратКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗатрат</name>
    <type>
      <types>EnumRef.ВидыЗатратКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗатрат</name>
    <type>
      <types>EnumRef.ТипыЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/НачислениеДоходов/НачислениеДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачислениеДоходов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Юрлицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/ВидыЗатратКомпании/ВидыЗатратКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗатратКомпании</name>
  <enumValues>
    <name>ПрямыеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РаспределяемыеРасходы</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/НачислениеЗатрат/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НачислениеЗатрат 
	Движения.НачислениеЗатрат.Записывать = Истина;
	Движения.НачислениеЗатрат.Очистить();
	Для Каждого ТекСтрокаПрямыеЗатраты Из ПрямыеЗатраты Цикл
		Движение = Движения.НачислениеЗатрат.Добавить();
		//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;	
		//Движение.Регистратор = ЭтотОбъект.Ссылка;
		Движение.Период = Дата;
		Движение.Партнер = ТекСтрокаПрямыеЗатраты.Партнер;
		Движение.СтатьяЗатрат = ТекСтрокаПрямыеЗатраты.СтатьяЗатрат;
		Движение.ТипЗатрат    = ТекСтрокаПрямыеЗатраты.СтатьяЗатрат.ТипЗатрат;
		Движение.КатегорияДоставки = ТекСтрокаПрямыеЗатраты.КатегорияДоставки;
		Движение.ТипЗаказа = ТекСтрокаПрямыеЗатраты.ТипЗаказа;
		Движение.ВидЗатрат = Перечисления.ВидыЗатратКомпании.ПрямыеРасходы;
		Движение.Сумма = ТекСтрокаПрямыеЗатраты.Сумма;
		Движение.Юрлицо = Справочники.Организации.НайтиПоКоду("000000001");
	КонецЦикла;

	// регистр НачислениеЗатрат 
	//Движения.НачислениеЗатрат.Записывать = Истина;
	//Движения.НачислениеЗатрат.Очистить();
	Для Каждого ТекСтрокаРаспределенныеЗатраты Из РаспределенныеЗатраты Цикл
		Движение = Движения.НачислениеЗатрат.Добавить();
		//Движение.Регистратор = ЭтотОбъект.Ссылка;
		Движение.Период = Дата;
		Движение.Партнер = ТекСтрокаРаспределенныеЗатраты.Партнер;
		Движение.СтатьяЗатрат = ТекСтрокаРаспределенныеЗатраты.СтатьяЗатрат;
		Движение.ТипЗатрат    = ТекСтрокаПрямыеЗатраты.СтатьяЗатрат.ТипЗатрат;
		Движение.КатегорияДоставки = ТекСтрокаРаспределенныеЗатраты.КатегорияДоставки;
		Движение.ТипЗаказа = ТекСтрокаРаспределенныеЗатраты.ТипЗаказа;
		Движение.ВидЗатрат = Перечисления.ВидыЗатратКомпании.РаспределяемыеРасходы;
		Движение.Сумма = ТекСтрокаРаспределенныеЗатраты.Сумма;
	КонецЦикла;

	// регистр НачислениеДоходов Приход
	Движения.НачислениеДоходов.Записывать = Истина;
	Движения.НачислениеДоходов.Очистить();
	Для Каждого ТекСтрокаДоходыКомпании Из ДоходыКомпании Цикл
		Движение = Движения.НачислениеДоходов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Партнер = ТекСтрокаДоходыКомпании.Партнер;
		Движение.СтатьяДоходов = ТекСтрокаДоходыКомпании.СтатьяДоходов;
		Движение.КатегорияДоставки = ТекСтрокаДоходыКомпании.КатегорияДоставки;
		Движение.ТипЗаказа = ТекСтрокаДоходыКомпании.ТипЗаказа;
		Движение.Сумма = ТекСтрокаДоходыКомпании.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
